tap "buildpacks/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts", "https://github.com/caskroom/homebrew-fonts"
tap "homebrew/cask-versions", "https://github.com/caskroom/homebrew-versions"
tap "homebrew/services"
tap "netbirdio/tap"
tap "osgeo/osgeo4mac"
tap "railwaycat/emacsmacport"
tap "rstacruz/backup"
tap "superbil/protobuf"
tap "superbil/superbil-mac-app"
tap "thoughtbot/formulae"
brew "act"
brew "openssl@3"
brew "aircrack-ng"
brew "xz"
brew "openexr"
brew "automake"
brew "coreutils"
brew "libyaml"
brew "asdf"
brew "gettext"
brew "python@3.9"
brew "atk"
brew "aws-shell"
brew "bash"
brew "binutils"
brew "bison"
brew "bitrise"
brew "icu4c"
brew "boost"
brew "c-ares"
brew "pkg-config"
brew "lzo"
brew "pixman"
brew "carthage"
brew "clang-format"
brew "cloc"
brew "cmake"
brew "cpanminus"
brew "ctags"
brew "curl"
brew "dialog"
brew "doxygen"
brew "duti"
brew "editorconfig"
brew "eigen"
brew "exiftool"
brew "expat"
brew "fribidi"
brew "fzf"
brew "mpfr"
brew "gawk"
brew "gdk-pixbuf"
brew "gh"
brew "jbig2dec"
brew "ghostscript"
brew "gibo"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "gnu-getopt"
brew "libgpg-error"
brew "libksba"
brew "pinentry"
brew "gnupg"
brew "gobject-introspection"
brew "graphviz"
brew "gsasl"
brew "gsl"
brew "highlight"
brew "hledger"
brew "htop"
brew "httpie"
brew "icdiff"
brew "libimobiledevice", args: ["HEAD"]
brew "ideviceinstaller"
brew "python@3.8"
brew "imagemagick"
brew "ios-deploy"
brew "iperf3"
brew "jansson"
brew "oniguruma"
brew "jq"
brew "lesspipe"
brew "libass"
brew "libbpg"
brew "proj"
brew "libgeotiff"
brew "libxml2"
brew "lzlib"
brew "mackup"
brew "mailutils"
brew "mas"
brew "mg"
brew "mosh"
brew "mtr"
brew "nmap"
brew "openjdk"
brew "openssh"
brew "pipx"
brew "portmidi"
brew "ripgrep"
brew "roswell"
brew "rsync"
brew "scons"
brew "sdl12-compat"
brew "ssh-copy-id", link: true
brew "utf8proc"
brew "subversion"
brew "swiftformat"
brew "syncthing", restart_service: true
brew "tealdeer"
brew "telnet"
brew "terraform"
brew "terraform-docs"
brew "texinfo", link: false
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "tree"
brew "unar"
brew "uncrustify"
brew "watch"
brew "wireguard-go"
brew "wireguard-tools"
brew "wxwidgets"
brew "xapian"
brew "xcodegen"
brew "yarn"
brew "youtube-dl"
brew "zile"
brew "zsh"
brew "zsh-syntax-highlighting"
brew "buildpacks/tap/pack"
cask "1password"
cask "adium"
cask "airserver"
cask "alfred"
cask "android-studio"
cask "anvil"
cask "arduino"
cask "basecamp"
cask "clyang-welly"
cask "coconutbattery"
cask "db-browser-for-sqlite"
cask "discord"
cask "dropbox"
cask "emacs-mac"
cask "firefox"
cask "flux"
cask "font-source-code-pro"
cask "font-source-han-noto-cjk"
cask "font-source-han-sans"
cask "freemind"
cask "google-chrome"
cask "google-cloud-sdk"
cask "grandperspective"
cask "hammerspoon"
cask "handbrake"
cask "hex-fiend"
cask "iina"
cask "imagealpha"
cask "insomnia"
cask "iterm2"
cask "iterm2-beta"
cask "joinme"
cask "keybase"
cask "keycastr"
cask "knock"
cask "licecap"
cask "mac2imgur"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "microsoft-teams"
cask "nally"
cask "netbird-ui"
cask "notational-velocity"
cask "notion"
cask "obs"
cask "osxfuse"
cask "paw"
cask "pgadmin3"
cask "postico"
cask "sequel-pro"
cask "signal"
cask "sketch-toolbox"
cask "slack"
cask "slate"
cask "spotify"
cask "suspicious-package"
cask "telegram"
cask "tunnelblick"
cask "vial"
cask "visual-studio-code"
cask "vlc"
cask "wireshark"
cask "xquartz"
cask "zterm"
