tap "d12frosted/emacs-plus"
tap "dart-lang/dart"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jimeh/emacs-builds"
tap "linode/cli"
# tap "miderwong/flutter"
tap "railwaycat/emacsmacport"
tap "superbil/superbil-mac-app"
tap "thoughtbot/formulae"
tap "uranusjr/pythonup"
tap "ycd/tap"
brew "ack"
brew "libyaml"
brew "readline"
brew "xz"
brew "ansible"
brew "jpeg-xl"
brew "archey"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
brew "gmp"
brew "coreutils"
brew "asdf"
brew "aspell"
brew "bash"
# Garbage collector for C and C++
brew "bat"
brew "bdw-gc"
# Parser generator
brew "binutils"
brew "bison"
# C/C++ and Java libraries for Unicode and globalization
brew "bitrise"
brew "icu4c"
# Collection of portable C++ source libraries
brew "boost"
# Real-time data compression library
brew "libffi"
brew "glib"
brew "lzo"
brew "carthage"
brew "libtasn1"
brew "gnutls"
brew "jansson"
brew "emacs", link: false
# Emacs dependency management
brew "cask"
# Hyperfast web frontend for Git repositories written in C
brew "cgit"
brew "clang-format"
# Library for handling page faults in user mode
brew "libsigsegv"
# GNU CLISP, a Common Lisp implementation
brew "clisp"
# Statistics utility to count lines of code
brew "cloc"
# Common Lisp implementation with a long history
brew "clozure-cl"
# Configurable talking characters in ASCII art
brew "cmake"
brew "cmatrix"
brew "cookiecutter"
brew "cowsay"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
brew "rtmpdump"
brew "curl"
brew "ddrescue"
brew "dialog"
brew "diffutils"
brew "docbook"
brew "doctl"
brew "doxygen"
# Drone CLI
brew "drone-cli"
# Select default apps for documents and URL schemes on macOS
brew "duti"
# Maintain consistent coding style between multiple editors
brew "editorconfig"
brew "llvm"
brew "emacs-clang-complete-async"
brew "exiftool"
brew "expat"
brew "ext4fuse"
brew "flac"
brew "fribidi"
brew "lame"
brew "libarchive"
brew "libass"
brew "x264"
brew "zeromq"
brew "ffmpeg"
brew "ffsend"
brew "figlet"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Infamous electronic fortune-cookie generator
brew "fortune"
brew "freexl"
brew "fzf"
brew "gawk"
brew "geos"
brew "jbig2dec"
brew "gibo"
brew "git"
brew "git-cal"
brew "git-delta"
brew "git-extras"
brew "gnu-getopt"
brew "git-flow-avh"
brew "git-imerge"
brew "git-lfs"
brew "libgpg-error"
brew "libgcrypt"
brew "libksba"
brew "pinentry"
brew "gnupg"
brew "git-secret"
brew "glances"
brew "gnu-indent"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-units"
brew "gnu-which", args: ["with-default-names"]
brew "go"
brew "jasper"
brew "pango"
brew "librsvg"
brew "graphviz"
brew "grep"
brew "gsasl"
brew "gsettings-desktop-schemas"
brew "help2man"
brew "lua"
brew "highlight"
brew "hledger"
brew "httpie"
brew "hugo"
brew "libusbmuxd"
brew "libimobiledevice"
brew "libzip"
brew "ideviceinstaller"
brew "iftop"
brew "ilmbase"
brew "shared-mime-info"
brew "python@3.8"
brew "imagemagick"
brew "ios-deploy"
brew "iperf3"
brew "ipfs"
brew "ipython"
brew "jenkins-lts"
brew "oniguruma"
brew "jq"
brew "kompose"
brew "lesspipe"
brew "libconfig"
brew "libdvdcss"
brew "libepoxy"
brew "libgccjit"
brew "libusb-compat"
brew "libgphoto2"
brew "libiconv"
brew "libxml2"
brew "proj"
brew "libspatialite"
brew "lnav"
brew "lzlib"
brew "m-cli"
brew "mackup"
brew "mailutils"
brew "make"
brew "mas"
brew "mercurial"
brew "mergepbx"
brew "mg"
brew "mint"
brew "mitmproxy"
brew "mkcert"
brew "mosh"
brew "net-snmp"
brew "nethack"
brew "nmap"
brew "nvm"
brew "openblas"
brew "opencc"
brew "openexr@2"
brew "openjdk"
brew "p7zip"
brew "pacapt"
brew "pandoc"
brew "qrencode"
brew "tree"
brew "pass"
brew "pdfcrack"
# Python dependency management tool
brew "pipenv"
brew "pipx"
brew "plantuml"
brew "putty"
brew "rbenv"
brew "ripgrep"
brew "roswell"
brew "rsync"
brew "rust"
brew "sane-backends"
brew "sbcl"
brew "screen"
brew "shellcheck"
brew "smartmontools"
brew "socat"
brew "speedtest-cli"
brew "squirrel", link: false
brew "ssh-copy-id", link: true
brew "stow"
brew "streamlink"
brew "utf8proc"
brew "subversion"
brew "swift-protobuf"
brew "swiftformat"
brew "swig"
brew "syncthing"
brew "telnet"
brew "terminal-notifier"
brew "terraform"
brew "terraform-docs"
brew "texinfo"
# Code-search similar to ack
brew "the_silver_searcher"
brew "tig"
brew "tmux"
brew "trash"
brew "twtxt"
brew "uncrustify"
brew "uni2ascii"
brew "w3m"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "wxwidgets"
brew "xapian"
brew "xcodegen"
brew "xmlstarlet"
brew "yarn"
brew "youtube-dl"
brew "yt-dlp"
brew "z"
brew "zlib"
# The Dart SDK
brew "dart-lang/dart/dart"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-emacs-big-sur-icon", "with-glib", "with-imagemagick", "with-rsvg"], link: false
brew "ycd/tap/dstp"
cask "airserver"
cask "alfred"
cask "android-file-transfer"
cask "android-studio"
cask "appcode"
cask "arduino"
cask "bettertouchtool"
cask "betterzip"
cask "calibre"
cask "cheatsheet"
cask "cloudapp"
cask "clyang-welly"
cask "controllermate"
cask "core-data-editor"
cask "cyberduck"
cask "db-browser-for-sqlite"
cask "dbeaver-community"
cask "dictunifier"
cask "discord"
cask "divvy"
cask "docker"
cask "docker-toolbox"
cask "electron-api-demos"
cask "emacs-app"
cask "evernote"
cask "fig"
cask "firefox"
cask "flux"
cask "font-fira-code"
cask "font-fira-mono"
cask "font-fontawesome"
cask "font-inconsolata"
cask "font-montserrat"
cask "font-noto-sans-cjk"
cask "font-open-sans"
cask "font-roboto"
cask "font-source-code-pro"
cask "font-source-han-noto-cjk"
cask "font-source-han-sans"
cask "font-source-sans-pro"
cask "fork"
cask "freemind"
cask "gather"
cask "google-cloud-sdk"
cask "google-drive"
cask "google-drive-file-stream"
cask "grandperspective"
cask "growlnotify"
cask "hammerspoon"
cask "handbrake"
cask "iina"
cask "imagealpha"
cask "inkscape"
cask "iterm2"
cask "iterm2-beta"
cask "keepassxc"
cask "keka"
cask "keybase"
cask "keycastr"
cask "kindle"
cask "kindle-comic-creator"
cask "kindle-previewer"
cask "kitematic"
cask "knock"
cask "knockknock"
cask "lbry"
cask "libreoffice"
cask "licecap"
cask "macdown"
cask "mactex"
cask "mactracker"
cask "microsoft-auto-update"
cask "microsoft-edge"
cask "monitorcontrol"
cask "mpv"
cask "nethackcocoa"
cask "notational-velocity"
cask "notion"
cask "obs"
cask "opensim"
cask "oversight"
cask "postman-agent"
cask "provisionql"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "raycast"
cask "realm-browser"
cask "sequel-pro"
cask "signal"
cask "silverlight"
cask "simple-comic"
cask "sketchup"
cask "skype"
cask "sourcetree"
cask "spotify"
cask "sqlitebrowser"
cask "squirrel"
cask "stats"
cask "suspicious-package"
cask "tableplus"
cask "teamviewer"
cask "techstoreclub-simple-comic"
cask "teensy"
cask "telegram"
cask "temurin8"
cask "tunnelblick"
cask "twitch"
cask "typinator"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "webpquicklook"
cask "wine-staging"
cask "wireshark"
cask "xamarin-android"
cask "xamarin-android-player"
cask "xamarin-mdk"
cask "xquartz"
cask "yacreader"
cask "zulip"
mas "Affinity Photo", id: 824183456
mas "Airmail", id: 918858936
mas "APNS-Tool", id: 963558865
mas "Apple Configurator 2", id: 1037126344
mas "BetterSnapTool", id: 417375580
mas "BitPay", id: 1440200291
mas "Bitwarden", id: 1352778147
mas "CalendarBar", id: 419329142
mas "CallPad", id: 932941515
mas "Canopy", id: 1419224245
mas "Carousel", id: 437548184
mas "CleanMyDrive 2", id: 523620159
mas "ColorSnapper", id: 418176775
mas "Darkroom", id: 953286746
mas "DevCleaner", id: 1388020431
mas "Developer", id: 640199958
mas "Disk Space Analyzer Free", id: 446243721
mas "Duplicate Photos Fixer Pro", id: 963642514
mas "Earth 3D", id: 476566660
mas "Fantastical", id: 975937182
mas "Genki Arcade", id: 1555925018
mas "GitStatusCheck", id: 859811997
mas "Growl", id: 467939042
mas "HEIC Converter", id: 1294126402
mas "iCoinTicker", id: 1248168577
mas "iHosts", id: 1102004240
mas "iMovie", id: 408981434
mas "iThoughtsX", id: 720669838
mas "Keynote", id: 409183694
mas "Kindle", id: 405399194
mas "KKBOX", id: 1105332179
mas "LightBlue", id: 639944780
mas "LINE", id: 539883307
mas "Liya", id: 455484422
mas "Marked", id: 448925439
mas "Memory Clean", id: 451444120
mas "Microsoft Excel", id: 462058435
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft Word", id: 462054704
mas "NFC Tools for Desktop", id: 1392471092
mas "Noizio", id: 928871589
mas "Notability", id: 360593530
mas "Numbers", id: 409203825
mas "OneShot", id: 892334975
mas "Output", id: 435867551
mas "Pages", id: 409201541
mas "PortsMonitor", id: 508288588
mas "Reeder", id: 1449412482
mas "Simplenote", id: 692867256
mas "Skitch", id: 425955336
mas "Slack", id: 803453959
mas "Smart JSON Editor", id: 1268962404
mas "Sparkbox", id: 488652149
mas "Sunrise Calendar", id: 886106985
mas "Swiftify for Xcode", id: 1183412116
mas "Telegram", id: 747648890
mas "The Unarchiver", id: 425424353
mas "Translate Tab", id: 458887729
mas "Trello", id: 1278508951
mas "Tweetbot", id: 1384080005
mas "TweetDeck", id: 485812721
mas "TweetRain", id: 944275813
mas "Twitter", id: 1482454543
mas "Voila", id: 407741870
mas "VPN Unlimited", id: 727593140
mas "Wire", id: 931134707
mas "WireGuard", id: 1451685025
mas "Xliffie", id: 961651406
